modm-ext/data.modm.io/docs/svd/header_stm32h747xg_cm7.svd
        <register>
          <name>ADC1R</name>
          <description>HRTIM ADC Trigger 1 register</description>
          <addressOffset>0x3bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AD1MC1</name>
              <description>ADC Trigger 1 on master compare 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1MC2</name>
              <description>ADC Trigger 1 on master compare 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1MC3</name>
              <description>ADC Trigger 1 on master compare 3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1MC4</name>
              <description>ADC Trigger 1 on master compare 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1MPER</name>
              <description>ADC Trigger 1 on master period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1EEV1</name>
              <description>ADC Trigger 1 on external event 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1EEV2</name>
              <description>ADC Trigger 1 on external event 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1EEV3</name>
              <description>ADC Trigger 1 on external event 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1EEV4</name>
              <description>ADC Trigger 1 on external event 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1EEV5</name>
              <description>ADC Trigger 1 on external event 5</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TAC2</name>
              <description>ADC Trigger 1 on Timer A compare 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TAC3</name>
              <description>ADC Trigger 1 on Timer A compare 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TAC4</name>
              <description>ADC Trigger 1 on Timer A compare 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TAPER</name>
              <description>ADC Trigger 1 on Timer A period</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TARST</name>
              <description>ADC Trigger 1 on Timer A reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TBC2</name>
              <description>ADC Trigger 1 on Timer B compare 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TBC3</name>
              <description>ADC Trigger 1 on Timer B compare 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TBC4</name>
              <description>ADC Trigger 1 on Timer B compare 4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TBPER</name>
              <description>ADC Trigger 1 on Timer B period</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TBRST</name>
              <description>ADC Trigger 1 on Timer B reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TCC2</name>
              <description>ADC Trigger 1 on Timer C compare 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TCC3</name>
              <description>ADC Trigger 1 on Timer C compare 3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TCC4</name>
              <description>ADC Trigger 1 on Timer C compare 4</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TCPER</name>
              <description>ADC Trigger 1 on Timer C period</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TDC2</name>
              <description>ADC Trigger 1 on Timer D compare 2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TDC3</name>
              <description>ADC Trigger 1 on Timer D compare 3</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TDC4</name>
              <description>ADC Trigger 1 on Timer D compare 4</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TDPER</name>
              <description>ADC Trigger 1 on Timer D period</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TEC2</name>
              <description>ADC Trigger 1 on Timer E compare 2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TEC3</name>
              <description>ADC Trigger 1 on Timer E compare 3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TEC4</name>
              <description>ADC Trigger 1 on Timer E compare 4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD1TEPER</name>
              <description>ADC Trigger 1 on Timer E period</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2R</name>
          <description>HRTIM ADC Trigger 2 register</description>
          <addressOffset>0x3c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AD2MC1</name>
              <description>ADC Trigger 2 on master compare 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2MC2</name>
              <description>ADC Trigger 2 on master compare 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2MC3</name>
              <description>ADC Trigger 2 on master compare 3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2MC4</name>
              <description>ADC Trigger 2 on master compare 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2MPER</name>
              <description>ADC Trigger 2 on master period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2EEV6</name>
              <description>ADC Trigger 2 on external event 6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2EEV7</name>
              <description>ADC Trigger 2 on external event 7</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2EEV8</name>
              <description>ADC Trigger 2 on external event 8</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2EEV9</name>
              <description>ADC Trigger 2 on external event 9</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2EEV10</name>
              <description>ADC Trigger 2 on external event 10</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TAC2</name>
              <description>ADC Trigger 2 on Timer A compare 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TAC3</name>
              <description>ADC Trigger 2 on Timer A compare 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TAC4</name>
              <description>ADC Trigger 2 on Timer A compare 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TAPER</name>
              <description>ADC Trigger 2 on Timer A period</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TBC2</name>
              <description>ADC Trigger 2 on Timer B compare 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TBC3</name>
              <description>ADC Trigger 2 on Timer B compare 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TBC4</name>
              <description>ADC Trigger 2 on Timer B compare 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TBPER</name>
              <description>ADC Trigger 2 on Timer B period</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TCC2</name>
              <description>ADC Trigger 2 on Timer C compare 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TCC3</name>
              <description>ADC Trigger 2 on Timer C compare 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TCC4</name>
              <description>ADC Trigger 2 on Timer C compare 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TCPER</name>
              <description>ADC Trigger 2 on Timer C period</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TCRST</name>
              <description>ADC Trigger 2 on Timer C reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TDC2</name>
              <description>ADC Trigger 2 on Timer D compare 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TDC3</name>
              <description>ADC Trigger 2 on Timer D compare 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TDC4</name>
              <description>ADC Trigger 2 on Timer D compare 4</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TDPER</name>
              <description>ADC Trigger 2 on Timer D period</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TDRST</name>
              <description>ADC Trigger 2 on Timer D reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TEC2</name>
              <description>ADC Trigger 2 on Timer E compare 2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TEC3</name>
              <description>ADC Trigger 2 on Timer E compare 3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TEC4</name>
              <description>ADC Trigger 2 on Timer E compare 4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD2TERST</name>
              <description>ADC Trigger 2 on Timer E reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC3R</name>
          <description>HRTIM ADC Trigger 3 register</description>
          <addressOffset>0x3c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AD3MC1</name>
              <description>ADC Trigger 3 on master compare 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3MC2</name>
              <description>ADC Trigger 3 on master compare 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3MC3</name>
              <description>ADC Trigger 3 on master compare 3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3MC4</name>
              <description>ADC Trigger 3 on master compare 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3MPER</name>
              <description>ADC Trigger 3 on master period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3EEV1</name>
              <description>ADC Trigger 3 on external event 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3EEV2</name>
              <description>ADC Trigger 3 on external event 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3EEV3</name>
              <description>ADC Trigger 3 on external event 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3EEV4</name>
              <description>ADC Trigger 3 on external event 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3EEV5</name>
              <description>ADC Trigger 3 on external event 5</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TAC2</name>
              <description>ADC Trigger 3 on Timer A compare 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TAC3</name>
              <description>ADC Trigger 3 on Timer A compare 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TAC4</name>
              <description>ADC Trigger 3 on Timer A compare 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TAPER</name>
              <description>ADC Trigger 3 on Timer A period</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TARST</name>
              <description>ADC Trigger 3 on Timer A reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TBC2</name>
              <description>ADC Trigger 3 on Timer B compare 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TBC3</name>
              <description>ADC Trigger 3 on Timer B compare 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TBC4</name>
              <description>ADC Trigger 3 on Timer B compare 4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TBPER</name>
              <description>ADC Trigger 3 on Timer B period</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TBRST</name>
              <description>ADC Trigger 3 on Timer B reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TCC2</name>
              <description>ADC Trigger 3 on Timer C compare 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TCC3</name>
              <description>ADC Trigger 3 on Timer C compare 3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TCC4</name>
              <description>ADC Trigger 3 on Timer C compare 4</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TCPER</name>
              <description>ADC Trigger 3 on Timer C period</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TDC2</name>
              <description>ADC Trigger 3 on Timer D compare 2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TDC3</name>
              <description>ADC Trigger 3 on Timer D compare 3</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TDC4</name>
              <description>ADC Trigger 3 on Timer D compare 4</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TDPER</name>
              <description>ADC Trigger 3 on Timer D period</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TEC2</name>
              <description>ADC Trigger 3 on Timer E compare 2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TEC3</name>
              <description>ADC Trigger 3 on Timer E compare 3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TEC4</name>
              <description>ADC Trigger 3 on Timer E compare 4</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AD3TEPER</name>
              <description>ADC Trigger 3 on Timer E period</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
